tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# GNU compiler collection
brew "gcc"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Drop-in replacement for MySQL
brew "mariadb"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Implementation of Telnet and SSH
brew "putty"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Safe, concurrent, practical language
brew "rust"
# Cross-shell prompt for astronauts
brew "starship"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Enable Windows-like alt-tab
cask "alt-tab"
# Chromium based browser
cask "arc"
# Voice and text chat software
cask "discord"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Developer targeted fonts with a high number of glyphs
cask "font-geist-mono-nerd-font"
# Desktop client for GitHub repositories
cask "github"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Presentation software
cask "microsoft-powerpoint"
# Word processor
cask "microsoft-word"
# Desktop virtualization software
cask "parallels"
# Remote desktop
cask "parsec"
# SSH client
cask "termius"
# Music streaming service with high fidelity sound and hi-def video quality
cask "tidal"
# Tool to invert scroll direction for physical scroll wheels
cask "unnaturalscrollwheels"
# Open-source code editor
cask "visual-studio-code"
# Network protocol analyzer
cask "wireshark"
vscode "acidic9.glua"
vscode "actboy168.lua-debug"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "brapifra.c-compiler"
vscode "caolin.java-run"
vscode "cschlosser.doxdocgen"
vscode "cweijan.vscode-office"
vscode "daltonmenezes.aura-theme"
vscode "danielpinto8zz6.c-cpp-compile-run"
vscode "devcat.lua-debug"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "donjayamanne.javadebugger"
vscode "dotdevru.prettier-java"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "evaera.vscode-rojo"
vscode "gccfeli.vscode-lua"
vscode "georgewfraser.vscode-javac"
vscode "git-techreview.git-techreview"
vscode "github.copilot"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "harikrishnan94.cxx-compiler-explorer"
vscode "icrawl.discord-vscode"
vscode "j69.ejs-beautify"
vscode "jeff-hykin.better-cpp-syntax"
vscode "keyring.lua"
vscode "kleber-swf.unity-code-snippets"
vscode "mactkg.sonic-pi"
vscode "matthewevers.compiler-explorer"
vscode "mikestead.dotenv"
vscode "ms-dotnettools.csharp"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "muoshuu.rojo-ui"
vscode "neodynamicsrl.jspm"
vscode "redhat.java"
vscode "rishabh.discord-theme"
vscode "ritwickdey.liveserver"
vscode "satoren.lualint"
vscode "stephenking.logo"
vscode "subtixx.mtasa-lua"
vscode "sumneko.lua"
vscode "taodongwu.ejs-snippets"
vscode "tobiah.unity-tools"
vscode "trass3r.cxx-compiler-explorer"
vscode "trixnz.vscode-lua"
vscode "twxs.cmake"
vscode "unity.unity-debug"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "xdebug.php-debug"
vscode "yinfei.luahelper"
vscode "youmaycallmev.vscode-java-saber"
vscode "yuenm18.ooxml-viewer"
vscode "zobo.php-intellisense"
